# Road_InsertStation

## Description
Insert a new station to the Roadway (Poly) object.

```pascal
PROCEDURE Road_InsertStation(
				hRoadwayObject : HANDLE;
				point          : REAL);
```

```python
def vs.Road_InsertStation(hRoadwayObject, point):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hRoadwayObject|HANDLE|   |
|point|REAL|   |

## Version
Availability: from Vectorworks 2015

## Category
* Roadway Interface Library